Repository: jrajaniemi/BikeComputerSwiftUI
Catalog: BikeComputer/Components/Localizable.xcstrings
Source language: en
Languages: ar, bg, bs, ca, cs, da, de, el, es, et, fi, fr, ga, ga_ie, ha, he, hi, hr, hu, hy, id, is, it, ja, ka, ko, ku, la, lt, lv, mk, ms, mt, nb, nl, pa, pl, pt, pt_pt, qu, rm, rm_ch, ro, ru, sk, sl, sq, sr, sv, sw, th, tr, uk_ua, ur, vi, zh, zh_hant

source: If the battery level goes below 25 percent, the app switches to maximum power-saving mode. In this mode, the app further reduces how often it updates GPS, uses even less accurate data, and may stop updating location if the device is not moving. This helps keep the device running as long as possible, but it greatly reduces the app performance and accuracy.
ar: إذا انخفض مستوى البطارية إلى أقل من 25 بالمائة، يقوم التطبيق بالتبديل إلى وضع توفير الطاقة الأقصى. في هذا الوضع، يقلل التطبيق بشكل كبير من عدد مرات تحديث GPS، ويستخدم بيانات أقل دقة، وقد يتوقف عن تحديث الموقع إذا لم تكن الجهاز يتحرك. يساعد ذلك في تشغيل الجهاز لأطول فترة ممكنة، ولكنه يقلل بشكل كبير من أداء ودقة التطبيق.
bg: Ако нивото на батерията падне под 25 процента, приложението превключва в режим на максимално пестене на енергия. В този режим приложението допълнително намалява честотата на актуализации на GPS, използва дори по-малко точни данни и може да спре актуализирането на местоположението, ако устройството не се движи. Това помага устройството да работи възможно най-дълго, но значително намалява производителността и точността на приложението.
bs: Ako nivo baterije padne ispod 25 posto, aplikacija prelazi u maksimalni režim štednje energije. U ovom režimu, aplikacija dodatno smanjuje učestalost ažuriranja GPS-a, koristi još manje tačne podatke i može prestati ažurirati lokaciju ako se uređaj ne kreće. Ovo pomaže uređaju da radi što duže, ali značajno smanjuje performanse i tačnost aplikacije.
ca: Si el nivell de bateria baixa per sota del 25 per cent, l'aplicació canvia al mode d'estalvi d'energia màxim. En aquest mode, l'aplicació redueix encara més la freqüència d'actualització del GPS, utilitza dades encara menys precises i pot deixar d'actualitzar la ubicació si el dispositiu no es mou. Això ajuda a mantenir el dispositiu funcionant tant de temps com sigui possible, però disminueix molt el rendiment i l'exactitud de l'aplicació.
cs: Pokud úroveň baterie klesne pod 25 procent, aplikace přepne do režimu maximální úspory energie. V tomto režimu aplikace dále snižuje frekvenci aktualizací GPS, používá méně přesná data a může přestat aktualizovat polohu, pokud se zařízení nepohybuje. To pomáhá udržet zařízení v chodu co nejdéle, ale značně to snižuje výkon a přesnost aplikace.
da: Hvis batteriniveauet kommer under 25 procent, skifter appen til maksimal strømbesparelsestilstand. I denne tilstand reducerer appen yderligere, hvor ofte den opdaterer GPS, bruger endnu mindre nøjagtige data og kan stoppe med at opdatere placering, hvis enheden ikke bevæger sig. Dette hjælper med at holde enheden kørende så længe som muligt, men det reducerer i høj grad appens ydeevne og nøjagtighed.
de: Wenn der Batteriestand unter 25 Prozent sinkt, wechselt die App in den maximalen Energiesparmodus. In diesem Modus verringert die App weiter, wie oft sie GPS aktualisiert, verwendet noch ungenauere Daten und kann die Standortaktualisierung einstellen, falls das Gerät sich nicht bewegt. Dies hilft, das Gerät so lange wie möglich am Laufen zu halten, verringert jedoch erheblich die Leistung und Genauigkeit der App.
el: Εάν το επίπεδο της μπαταρίας πέσει κάτω από 25 τοις εκατό, η εφαρμογή μεταβαίνει σε λειτουργία μέγιστης εξοικονόμησης ενέργειας. Σε αυτή τη λειτουργία, η εφαρμογή μειώνει περαιτέρω τη συχνότητα των ενημερώσεων του GPS, χρησιμοποιεί ακόμα λιγότερο ακριβή δεδομένα και μπορεί να σταματήσει η ενημέρωση της τοποθεσίας, εάν η συσκευή δεν κινείται. Αυτό βοηθάει στη διατήρηση της συσκευής σε λειτουργία για όσο το δυνατόν περισσότερο, αλλά μειώνει σημαντικά την απόδοση και την ακρίβεια της εφαρμογής.
es: Si el nivel de la batería baja del 25 por ciento, la app cambia al modo de ahorro de energía máximo. En este modo, la app reduce aún más la frecuencia con la que actualiza el GPS, usa datos aún menos precisos y puede dejar de actualizar la ubicación si el dispositivo no se está moviendo. Esto ayuda a mantener el dispositivo funcionando el mayor tiempo posible, pero reduce en gran medida el rendimiento y la precisión de la app.
et: Kui aku tase langeb alla 25 protsendi, lülitub rakendus maksimaalsesse energiasäästurežiimi. Selles režiimis vähendab rakendus veelgi GPS-i uuendamise sagedust, kasutab veelgi ebatäpsemaid andmeid ja võib lõpetada asukoha uuendamise, kui seade ei liigu. See aitab hoida seadet töös võimalikult kaua, kuid vähendab oluliselt rakenduse jõudlust ja täpsust.
fi: Jos akun varaustaso laskee alle 25 prosentin, sovellus siirtyy maksimaaliseen virransäästötilaan. Tässä tilassa sovellus vähentää entisestään GPS-päivitysten tiheyttä, käyttää vähemmän tarkkaa dataa ja lopettaa sijainnin päivittämisen, aina kun laite ei liiku. Tämä auttaa pitämään laitteen toiminnassa mahdollisimman pitkään, mutta heikentää merkittävästi sovelluksen suorituskykyä ja tarkkuutta.
fr: Si le niveau de la batterie descend en dessous de 25 pour cent, l'application passe en mode d'économie d'énergie maximale. Dans ce mode, l'application réduit encore la fréquence des mises à jour GPS, utilise des données encore moins précises et peut arrêter la mise à jour de la localisation si l'appareil ne bouge pas. Cela aide à maintenir l'appareil en fonctionnement aussi longtemps que possible, mais réduit considérablement la performance et la précision de l'application.
ga: Má théann leibhéal na ceallraí faoi bhun 25 faoin gcéad, aistríonn an aip go mód uaschumhacht-sábhála. Sa mhód seo, laghdaíonn an aip tuilleadh cé chomh minic agus atá sé ag nuashonrú GPS, úsáideann sé sonraí atá níos lú cruinn, agus féadfaidh sé stop a chur le nuashonrú suímh má tá an gléas gan bogadh. Cabhraíonn sé seo leis an gléas a choinneáil ag rith chomh fada agus is féidir, ach laghdaíonn sé feidhmíocht agus cruinneas an aip go mór.
ga_ie: Má théann leibhéal na ceallraí faoi bhun 25 faoin gcéad, aistríonn an aip go dtí an modh coigilte cumhachta uasta. Sa mhodh seo, laghdaíonn an aip chomh minic is a nuashonraíonn sé GPS, úsáideann sé sonraí níos neamhbhríonna fós agus féadfaidh sé stopadh ag nuashonrú suíomh má tá an gléas ina stad. Cuidíonn sé seo leis an ngléas a choinneáil ag feidhmiú chomh fada agus is féidir, ach laghdaíonn sé feidhmíocht agus cruinneas an aip go mór.
ha: Idan matakin baturi ya faɗi ƙasa da kashi 25 cikin ɗari, manhajar na canza zuwa yanayin ajiyar wuta mafi ƙarfi. A cikin wannan yanayin, manhajar na ƙara rage yawan lokacin da take sabunta GPS, tana amfani da bayanai marasa daidaito, kuma watakila ta daina sabunta wurin idan na'urar ba ta motsi. Wannan yana taimakawa wajen ci gaba da amfani da na'urar tsawon lokaci, amma yana rage aiki da daidaiton manhajar ƙwarai.
he: אם רמת הסוללה יורדת מתחת ל-25 אחוזים, האפליקציה עוברת למצב חיסכון מירבי באנרגיה. במצב זה, האפליקציה מקטינה עוד יותר את תדירות עדכוני ה-GPS, משתמשת בנתונים פחות מדויקים, ועשויה להפסיק לעדכן מיקום אם המכשיר לא זז. זה עוזר לשמור על המכשיר פועל כמה שיותר זמן, אך זה פוגע משמעותית בביצועי היישום ובדיוק שלו.
hi: अगर बैटरी स्तर 25 प्रतिशत से कम हो जाता है, तो ऐप अधिकतम बिजली-बचत मोड में स्विच हो जाती है। इस मोड में, ऐप और कम बार GPS अपडेट करता है, और भी कम सटीक डेटा का उपयोग करता है, और यदि डिवाइस नहीं हिल रहा है तो स्थान अपडेट करना बंद भी कर सकता है। यह डिवाइस को यथासंभव लंबी अवधि तक चलने में मदद करता है, लेकिन यह ऐप के प्रदर्शन और सटीकता को बहुत कम कर देता है।
hr: Ako razina baterije padne ispod 25 posto, aplikacija prelazi na maksimalni način uštede energije. U ovom načinu rada, aplikacija dodatno smanjuje učestalost ažuriranja GPS-a, koristi manje točne podatke, i može prestati ažurirati lokaciju ako se uređaj ne kreće. Ovo pomaže da uređaj radi što dulje moguće, ali uvelike smanjuje performanse i točnost aplikacije.
hu: Ha az akkumulátor töltöttségi szintje 25 százalék alá csökken, az alkalmazás maximális energiatakarékos módra vált. Ebben a módban az alkalmazás tovább csökkenti a GPS frissítések gyakoriságát, kevésbé pontos adatokat használ, és előfordulhat, hogy nem frissíti a helyzetet, ha az eszköz nem mozog. Ez segít az eszközt a lehető leghosszabb ideig működésben tartani, de jelentősen csökkenti az alkalmazás teljesítményét és pontosságát.
hy: Եթե մարտկոցի մակարդակը իջնում է 25 տոկոսից ցածր, հավելվածը անցնում է առավելագույն էներգախնայման ռեժիմի։ Այս ռեժիմում հավելվածը ավելի քիչ հաճախ թարմացնում է GPS-ը, օգտագործում է ավելի քիչ ճշգրիտ տվյալներ և կարող է դադարեցնել տեղանքի թարմացումը, եթե սարքը չի շարժվում։ Սա օգնում է սարքին հնարավորինս երկար աշխատել, բայց զգալիորեն նվազեցնում է հավելվածի կատարողականությունն ու ճշգրտությունը։
id: Jika level baterai turun di bawah 25 persen, aplikasi akan beralih ke mode penghematan daya maksimum. Dalam mode ini, aplikasi akan mengurangi seberapa sering memperbarui GPS, menggunakan data yang kurang akurat, dan mungkin berhenti memperbarui lokasi jika perangkat tidak bergerak. Hal ini membantu menjaga perangkat tetap berjalan selama mungkin, tetapi sangat mengurangi kinerja dan akurasi aplikasi.
is: Ef rafhlöðustigið fer undir 25 prósent, skiptir forritið yfir í hámarks aflmótunarham. Í þessum ham dregur forritið enn frekar úr hversu oft það uppfærir GPS, notar enn óáreiðanlegri gögn og getur hætt að uppfæra staðsetningu ef tækið er ekki á hreyfingu. Þetta hjálpar tækinu að halda gangandi eins lengi og hægt er, en dregur mjög úr frammistöðu og nákvæmni forritsins.
it: Se il livello della batteria scende sotto il 25 percento, l'app passa alla modalità di risparmio energetico massimo. In questa modalità, l'app riduce ulteriormente la frequenza di aggiornamento del GPS, utilizza dati ancora meno precisi e può smettere di aggiornare la posizione se il dispositivo non si muove. Questo aiuta a mantenere il dispositivo in funzione il più a lungo possibile, ma riduce notevolmente le prestazioni e la precisione dell'app.
ja: バッテリー残量が25％未満になると、アプリは最大限の省電力モードに切り替わります。このモードでは、GPSの更新頻度をさらに減らし、データの精度をさらに低下させ、デバイスが動いていない場合に位置情報の更新を停止することがあります。これにより、デバイスの稼働時間をできるだけ長く保つことができますが、アプリのパフォーマンスと精度は大幅に低下します。
ka: თუ ბატარეის დონე 25 პროცენტზე ქვევით იწევს, აპლიკაცია მაქსიმალურ ენერგიის დაზოგვის რეჟიმზე გადადის. ამ რეჟიმში, აპლიკაცია კიდევ უფრო ამცირებს GPS-ის განახლების სიხშირეს, იყენებს უფრო ნაკლებად ზუსტ მონაცემებს და შესაძლოა შეწყვიტოს ადგილმდებარეობის განახლება, თუ მოწყობილობა არ მოძრაობს. ეს ხელს უწყობს მოწყობილობას რაც შეიძლება დიდხანს მუშაობაში, მაგრამ მნიშვნელოვნად ამცირებს აპლიკაციის წარმადობასა და სიზუსტეს.
ko: 배터리 수준이 25% 이하로 떨어지면 앱이 최대 전원 절약 모드로 전환됩니다. 이 모드에서는 GPS 업데이트 빈도를 더욱 줄이고, 덜 정확한 데이터를 사용하며, 장치가 이동하지 않으면 위치 업데이트를 중지할 수 있습니다. 이는 장치를 가능한 한 오래 실행시키는 데 도움이 되지만, 앱의 성능과 정확성이 크게 저하됩니다.
ku: Eger asta la batri biçe jêrî 25 pirsent, bername dibêje herçeçerî pawan anî. Di vî moda de, bername dizî herçayî kêm bikeva GPS nûbele, têne pêşmêna kêm keçûva zaniyari, û dikare destjêy bikeva lokasyon nûbikîne eger amûre nikevin. Ev yeledemîdandina amûrê derbasde hemûîn rekey, lê serfirazî û razîbirkirina bername bi mezinî dipeyêje.
la: Si gradu altilium infra 25 centesimas decrescit, app mutat ad modum maximam parcendi vim. In hoc modo, app magis raro GPS renovat, minus accurate data utitur, et locum renovare desinat si machina non movet. Hoc adiuvat ad machinam quam diutissime operandam manere, sed vehementer minuunt app perficiendi et accurate.
lt: Jei akumuliatoriaus lygis nukrenta žemiau 25 procentų, programa pereina į maksimalų energijos taupymo režimą. Šiame režime programa dar labiau sumažina GPS atnaujinimų dažnį, naudoja dar mažiau tikslius duomenis ir gali nustoti atnaujinti vietovę, jei įrenginys nejuda. Tai padeda išlaikyti įrenginį veikiantį kuo ilgiau, bet žymiai sumažina programos veikimą ir tikslumą.
lv: Ja akumulatora līmenis nokrītas zem 25 procentiem, lietotne pārslēdzas uz maksimālo enerģijas taupīšanas režīmu. Šajā režīmā lietotne vēl vairāk samazina GPS atjaunināšanas biežumu, izmanto vēl mazāk precīzus datus un var pārtraukt atrašanās vietas atjaunināšanu, ja ierīce nepārvietojas. Tas palīdz ierīcei darboties pēc iespējas ilgāk, bet būtiski samazina lietotnes veiktspēju un precizitāti.
mk: Доколку нивото на батеријата падне под 25 проценти, апликацијата се префрла на максимален режим за заштеда на енергија. Во овој режим, апликацијата понатаму го намалува колку често го ажурира GPS-от, користи уште помалку прецизни податоци и може да престане со ажурирање на локацијата доколку уредот не се движи. Ова помага уредот да работи што е можно подолго, но значително ја намалува перформансата и прецизноста на апликацијата.
ms: Jika tahap bateri turun di bawah 25 peratus, aplikasi akan beralih ke mode penjimatan kuasa maksimum. Dalam mode ini, aplikasi mengurangkan kekerapan kemas kini GPS, menggunakan data yang kurang tepat, dan mungkin berhenti mengemas kini lokasi jika peranti tidak bergerak. Ini membantu peranti berfungsi selama mungkin, tetapi ia mengurangkan prestasi dan ketepatan aplikasi dengan ketara.
mt: Jekk il-livell tal-batterija jinżel taħt it-25 fil-mija, l-app tinbidel għall-mod massimu li jiffranka l-enerġija. F'dan il-mod, l-app tnaqqas aktar kemm-il darba taġġorna l-GPS, tuża data anqas preċiża, u tista' tieqaf taġġorna l-lokazzjoni jekk l-apparat ma jkunx qed jiċċaqlaq. Dan jgħin biex l-apparat jibqa' jaħdem kemm jista' jkun, iżda jnaqqas ħafna l-prestazzjoni u l-preċiżjoni tal-app.
nb: Hvis batterinivået går under 25 prosent, bytter appen til maksimal strømsparingsmodus. I denne modusen reduserer appen ytterligere hvor ofte den oppdaterer GPS, bruker enda mindre nøyaktige data, og kan slutte å oppdatere posisjonen hvis enheten ikke beveger seg. Dette hjelper enheten å kjøre så lenge som mulig, men det reduserer appens ytelse og nøyaktighet betydelig.
nl: Als het batterijniveau onder de 25 procent komt, schakelt de app over naar de maximale energiebesparingsmodus. In deze modus vermindert de app verder hoe vaak het GPS bijwerkt, gebruikt nog minder nauwkeurige gegevens en stopt mogelijk met het bijwerken van de locatie als het apparaat niet beweegt. Dit helpt het apparaat zo lang mogelijk te laten werken, maar het vermindert de prestaties en nauwkeurigheid van de app aanzienlijk.
pa: ਜੇ ਬੈਟਰੀ ਦੀ ਸਤਰ 25 ਫੀਸਦੀ ਤੋਂ ਘਟ ਜਾਂਦੀ ਹੈ, ਤਾਂ ਐਪ ਵੱਧ ਤੋਂ ਵੱਧ ਸ਼ਕਤੀ-ਬਚਤ ਮੋਡ ਵਿੱਚ ਸਵਿੱਚ ਕਰ ਦਿੰਦੀ ਹੈ। ਇਸ ਮੋਡ ਵਿੱਚ, ਐਪ ਗਲਾਇਕਸ਼ਨ ਨੂੰ ਅੱਪਡੇਟ ਕਰਨ ਦੀ ਆਵ੍ਰਿਤੀ ਹੋਰ ਘਟਾਉਂਦੀ ਹੈ, ਵੀ ਘੱਟ ਸਹੀ ਡਾਟਾ ਵਰਤਦੀ ਹੈ, ਅਤੇ ਜੇਕਰ ਡਿਵਾਈਸ ਨਹੀਂ ਹਿੱਲ ਰਿਹਾ ਹੈ ਤਾਂ ਸਥਿਤੀ ਅੱਪਡੇਟ ਕਰਨਾ ਬੰਦ ਕਰ ਸਕਦੀ ਹੈ। ਇਸ ਨਾਲ ਡਿਵਾਈਸ ਨੂੰ ਜਿੰਨਾ ਚਿਰ ਹੋ ਸਕੇ ਚਲਾਉਣ ਵਿੱਚ ਮਦਦ ਮਿਲਦੀ ਹੈ, ਪਰ ਇਹ ਐਪ ਦੀ ਕਾਰਗੁਜ਼ਾਰੀ ਅਤੇ ਸਹੀਯਤਾ ਨੂੰ ਬਹੁਤ ਘਟਾਉਂਦਾ ਹੈ।
pl: Jeśli poziom baterii spadnie poniżej 25 procent, aplikacja przełącza się na maksymalny tryb oszczędzania energii. W tym trybie aplikacja jeszcze bardziej zmniejsza częstotliwość aktualizacji GPS, używa jeszcze mniej dokładnych danych i może przestać aktualizować lokalizację, jeśli urządzenie się nie porusza. To pomaga utrzymać działanie urządzenia tak długo, jak to możliwe, ale znacznie obniża wydajność i dokładność aplikacji.
pt: Se o nível da bateria cair abaixo de 25 por cento, o aplicativo muda para o modo de economia máxima de energia. Nesse modo, o aplicativo reduz ainda mais a frequência das atualizações de GPS, usa dados ainda menos precisos e pode parar de atualizar a localização se o dispositivo não estiver se movendo. Isso ajuda a manter o dispositivo funcionando pelo maior tempo possível, mas reduz consideravelmente o desempenho e a precisão do aplicativo.
pt_pt: Se o nível da bateria descer abaixo de 25 por cento, a app muda para o modo máximo de poupança de energia. Neste modo, a app reduz ainda mais a frequência das atualizações do GPS, utiliza dados ainda menos precisos e pode parar de atualizar a localização se o dispositivo não estiver em movimento. Isto ajuda a manter o dispositivo a funcionar o máximo de tempo possível, mas reduz consideravelmente o desempenho e a precisão da app.
qu: Qan bateríta nivelqa huch'uy 25 paisjikunakun, appqa musuq simi ch'askipaymantan waqaychasqa kasqaykuy. Kay simipi, appqa wakinkunataña siqsiykamapayta huch'uyachin GPS, inachisqa datos apaykamaway, chaypipas siqsiykamapaña rik'iyta wakinchanchaqa mana maskapaspas purinman. Kaypas amachanchayta munan aparanasqa mach'a kasqa, icha suma uyarisqa app llinriskayniyu.
rm: Sch’igl nivel da bateria croda sut 25 pertschient, l’app mida al modus da spargnar energia maximal. En quest modus, l’app reducescha anc dapli la periodicità d’actualisar il GPS, utilisescha datas anc main precisas e po finir d’actualisar la posiziun sch’il dispositiv na sa mova betg. Quai gidia a tegnair il dispositiv en funcziun il pli ditg pussibel, ma reducescha fermamain la prestaziun e l’accuratezza da l’app.
rm_ch: Sche l' nivel da la battaria croda sut 25 pertschient, l' app passa al modus da spargnar maximal d' energia. En quest modus reducescha l' app anc dapli la frequenza dals actualisaziuns da GPS, dovra datas anc main correctas, ed è po arrestar las actualisaziuns da posiziun sch il dispositiv na è betg en movir. Quai gida a mantegnair il dispositiv en funcziun il pli ditg pussibel, pero reducescha considrablamein la prestaziun e la precisadad da l' app.
ro: Dacă nivelul bateriei scade sub 25%, aplicația comută la modul de economisire a energiei maxim. În acest mod, aplicația reduce și mai mult frecvența actualizărilor GPS, folosește date și mai puțin precise și poate opri actualizarea locației dacă dispozitivul nu se mișcă. Acest lucru ajută la menținerea funcționării dispozitivului cât mai mult posibil, dar reduce considerabil performanța și acuratețea aplicației.
ru: Если уровень заряда батареи опустится ниже 25 процентов, приложение переключится в режим максимальной экономии энергии. В этом режиме приложение ещё реже обновляет GPS, использует менее точные данные и может прекратить обновление местоположения, если устройство не двигается. Это помогает продлить работу устройства как можно дольше, но значительно снижает производительность и точность приложения.
sk: Ak úroveň batérie klesne pod 25 percent, aplikácia sa prepne do maximálneho úsporného režimu. V tomto režime aplikácia ďalej znižuje frekvenciu aktualizácií GPS, používa ešte menej presné údaje a môže prestať aktualizovať polohu, ak sa zariadenie nepohybuje. To pomáha udržiavať zariadenie v chode čo najdlhšie, ale značne znižuje výkon a presnosť aplikácie.
sl: Če raven baterije pade pod 25 odstotkov, aplikacija preklopi v način največjega varčevanja z energijo. V tem načinu aplikacija dodatno zmanjša pogostost posodabljanja GPS, uporablja še manj natančne podatke in lahko preneha posodabljati lokacijo, če se naprava ne premika. To pomaga napravi delovati čim dlje, vendar močno zmanjša zmogljivost in natančnost aplikacije.
sq: Nëse niveli i baterisë bie nën 25 përqind, aplikacioni kalon në modalitetin e kursimit maksimal të energjisë. Në këtë modalitet, aplikacioni zvogëlon më tej sa shpesh azhurnon GPS, përdor të dhëna edhe më pak të sakta dhe mund të ndalojë azhurnimin e vendndodhjes nëse pajisja nuk po lëviz. Kjo ndihmon që pajisja të funksionojë sa më gjatë të jetë e mundur, por zvogëlon ndjeshëm performancën dhe saktësinë e aplikacionit.
sr: Ako nivo baterije padne ispod 25 procenata, aplikacija prelazi u režim maksimalne uštede energije. U ovom režimu, aplikacija dodatno smanjuje učestalost ažuriranja GPS-a, koristi još manje precizne podatke, i može prestati sa ažuriranjem lokacije ako uređaj nije u pokretu. Ovo pomaže da uređaj radi što je duže moguće, ali značajno smanjuje performanse i tačnost aplikacije.
sv: Om batterinivån sjunker under 25 procent, växlar appen till maximalt strömsparläge. I detta läge minskar appen ytterligare hur ofta den uppdaterar GPS, använder ännu mindre noggrann data och kan sluta uppdatera plats om enheten inte rör sig. Detta hjälper enheten att hålla igång så länge som möjligt, men det minskar avsevärt appens prestanda och noggrannhet.
sw: Ikiwa kiwango cha betri kimeshuka chini ya asilimia 25, programu hubadilisha hadi hali ya kuokoa nguvu zaidi. Katika hali hii, programu inapunguza zaidi mara ngapi inasasisha GPS, inatumia data isiyo sahihi zaidi, na inaweza kuacha kusasisha eneo ikiwa kifaa hakisogei. Hii husaidia kifaa kufanya kazi kwa muda mrefu iwezekanavyo, lakini inapunguza sana utendaji na usahihi wa programu.
th: หากระดับแบตเตอรี่ต่ำกว่า 25 เปอร์เซ็นต์ แอปจะเปลี่ยนไปใช้โหมดประหยัดพลังงานสูงสุด ในโหมดนี้ แอปจะลดความถี่ในการอัพเดท GPS ลงอีก ใช้ข้อมูลที่ไม่แม่นยำมากขึ้น และอาจหยุดการอัพเดทตำแหน่งหากอุปกรณ์ไม่เคลื่อนไหว สิ่งนี้ช่วยให้อุปกรณ์ใช้งานได้นานที่สุด แต่มันจะลดประสิทธิภาพและความแม่นยำของแอปอย่างมาก
tr: Pil düzeyi yüzde 25'in altına düşerse, uygulama maksimum güç tasarrufu moduna geçer. Bu modda, uygulama GPS güncellemelerinin sıklığını daha da azaltır, daha az doğru veriler kullanır ve cihaz hareket etmiyorsa konum güncellemeyi durdurabilir. Bu, cihazın mümkün olduğunca uzun süre çalışmasını sağlar, ancak uygulamanın performansını ve doğruluğunu büyük ölçüde azaltır.
uk_ua: Якщо рівень заряду батареї опуститься нижче 25 відсотків, додаток перемикається на режим максимальної економії енергії. У цьому режимі додаток ще більше знижує частоту оновлення GPS, використовує ще менш точні дані та може припинити оновлення місцезнаходження, якщо пристрій не рухається. Це допомагає підтримувати роботу пристрою якомога довше, але значно знижує продуктивність і точність додатка.
ur: اگر بیٹری کا لیول 25 فیصد سے نیچے چلا جاتا ہے تو، ایپ زیادہ سے زیادہ بجلی بچانے کے موڈ پر منتقل ہو جاتی ہے۔ اس موڈ میں، ایپ جی پی ایس کو اپڈیٹ کرنے کی تعداد کو مزید کم کرتی ہے، کم درست ڈیٹا استعمال کرتی ہے، اور اگر ڈیوائس حرکت میں نہ ہو تو مقام کو اپڈیٹ کرنا بند کر سکتی ہے۔ اس سے ڈیوائس کو زیادہ دیر تک چلانے میں مدد ملتی ہے، لیکن یہ ایپ کی کارکردگی اور درستگی کو بہت کم کر دیتا ہے۔
vi: Nếu mức pin giảm xuống dưới 25 phần trăm, ứng dụng sẽ chuyển sang chế độ tiết kiệm pin tối đa. Trong chế độ này, ứng dụng giảm tần suất cập nhật GPS, sử dụng dữ liệu kém chính xác hơn và có thể ngừng cập nhật vị trí nếu thiết bị không di chuyển. Điều này giúp thiết bị hoạt động càng lâu càng tốt, nhưng nó làm giảm hiệu suất và độ chính xác của ứng dụng đáng kể.
zh: 如果电池电量低于25%，应用程序将切换到最大省电模式。在此模式下，应用程序进一步减少GPS更新频率，使用更不准确的数据，并且如果设备不移动，可能会停止更新位置。这有助于设备尽可能长时间运行，但大大降低了应用程序的性能和准确性。
zh_hant: 如果電池水平低於25%，應用程式會切換到最大省電模式。在這種模式下，應用程式會進一步減少更新GPS的頻率，使用更不準確的數據，並且如果設備沒有移動，可能會停止更新位置。這有助於使設備運行時間更長，但會大大降低應用程式的性能和準確性。

source: Invalid
ar: غير صالح
bg: Невалиден
bs: Nevažeće
ca: Invàlid
cs: Neplatný
da: Ugyldig
de: Ungültig
el: Μη έγκυρο
es: Inválido
et: Kehtetu
fi: Virheellinen
fr: Invalide
ga: Neamhbhailí
ga_ie: Neamhbhailí
ha: Marar inganci
he: לא חוקי
hi: अमान्य
hr: Nevažeće
hu: Érvénytelen
hy: Անվավեր
id: Tidak valid
is: Ógilt
it: Non valido
ja: 無効
ka: არასწორია
ko: 잘못된
ku: Xeletkari
la: Invalidus
lt: Neteisingas
lv: Nederīgs
mk: Неважечки
ms: Tidak sah
mt: Invalidu
nb: Ugyldig
nl: Ongeldig
pa: ਅਵੈਧ
pl: Nieprawidłowy
pt: Inválido
pt_pt: Inválido
qu: Mana
rm: Nunvalid
ru: Недействительно
sk: Neplatný
sl: Neveljavna
sq: Jojo
sr: Nevažeće
sv: Ogiltig
sw: Batili
th: ไม่ถูกต้อง
tr: Geçersiz
uk_ua: Недійсний
ur: غلط
vi: Không hợp lệ
zh: 无效
zh_hant: 無效
